S78/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottomWall
    {
        type            noSlip;
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
2500
(
(0.931617 0.637329 0)
(0.891722 0.692048 0)
(0.84844 0.744478 0)
(0.801889 0.7944 0)
(0.752204 0.841598 0)
(0.699532 0.885863 0)
(0.644036 0.926993 0)
(0.585893 0.964794 0)
...
)
;
    }
    sideWalls
    {
        type            noSlip;
    }
    outlet
    {
        type            zeroGradient;
    }
    topWall
    {
        type            noSlip;
    }
}


// ************************************************************************* //
