S78/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    bottomWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2500;
        startFace       441500;
    }
    inlet
    {
        type            patch;
        nFaces          2500;
        startFace       444000;
    }
    sideWalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3000;
        startFace       446500;
    }
    outlet
    {
        type            patch;
        nFaces          500;
        startFace       449500;
    }
    topWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2500;
        startFace       450000;
    }
)

// ************************************************************************* //
