S78/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;//0.1;

vertices
(
    (0 0 0)	//0 Inlet Bottom circle center
    (1 0 0)	//1 Inlet Bottom circle Quadrants
    (0 -1 0)	//2
    (-1 0 0)	//3
    (0 1 0)	//4

    (0 0 1)	//5 Inlet Top circle center
    (1 0 1)	//6 Inlet Top circle Quadrants
    (0 -1 1)	//7
    (-1 0 1)	//8
    (0 1 1)	//9

    (0 0 2.6)	//10 Outlet Bottom circle center
    (1 0 2.6)	//11 Outlet Bottom circle Quadrants
    (0 -1 2.6)	//12
    (-1 0 2.6)	//13
    (0 1 2.6)	//14

    (0 0 3)	//15 Outlet Top circle center
    (1 0 3)	//16 Outlet Top circle Quadrants
    (0 -1 3)	//17
    (-1 0 3)	//18
    (0 1 3)	//19

);

blocks
(
    hex (0 1 4 0 5 6 9 5) (25 25 25) simpleGrading (1.1 1.1 1.1)
    hex (0 4 3 0 5 9 8 5) (25 25 25) simpleGrading (1.1 1.1 1.1)
    hex (0 3 2 0 5 8 7 5) (25 25 25) simpleGrading (1.1 1.1 1.1)
    hex (0 2 1 0 5 7 6 5) (25 25 25) simpleGrading (1.1 1.1 1.1)

    hex (5 6 9 5 10 11 14 10) (25 25 30) simpleGrading (1.1 1.1 1.1)
    hex (5 9 8 5 10 14 13 10) (25 25 30) simpleGrading (1.1 1.1 1.1)
    hex (5 8 7 5 10 13 12 10) (25 25 30) simpleGrading (1.1 1.1 1.1)
    hex (5 7 6 5 10 12 11 10) (25 25 30) simpleGrading (1.1 1.1 1.1)

    hex (10 11 14 10 15 16 19 15) (25 25 5) simpleGrading (1.1 1.1 1.1)
    hex (10 14 13 10 15 19 18 15) (25 25 5) simpleGrading (1.1 1.1 1.1)
    hex (10 13 12 10 15 18 17 15) (25 25 5) simpleGrading (1.1 1.1 1.1)
    hex (10 12 11 10 15 17 16 15) (25 25 5) simpleGrading (1.1 1.1 1.1)
);
edges
(
    arc 1 4 (0.7071067812 0.7071067812 0)
//    arc 6 9 (0.7071067812 0.7071067812 1)

    arc 4 3 (-0.7071067812 0.7071067812 0)
//    arc 9 8 (-0.7071067812 0.7071067812 1)

    arc 3 2 (-0.7071067812 -0.7071067812 0)
//    arc 8 7 (-0.7071067812 -0.7071067812 1)

    arc 2 1 (0.7071067812 -0.7071067812 0)
//    arc 7 6 (0.7071067812 -0.7071067812 1)


    arc 6 9 (0.7071067812 0.7071067812 1)
//    arc 11 14 (0.7071067812 0.7071067812 1)

    arc 9 8  (-0.7071067812 0.7071067812 1)
//    arc 14 13 (-1.414213562 1.414213562 5.2)

    arc 8 7 (-0.7071067812 -0.7071067812 1)
//    arc 13 12 (-1.414213562 -1.414213562 5.2)

    arc 7 6 (0.7071067812 -0.7071067812 1)
//    arc 12 11 (1.414213562 -1.414213562 5.2)


    arc 11 14 (0.7071067812 0.7071067812 2.6)
    arc 16 19 (0.7071067812 0.7071067812 3.0)

    arc 14 13 (-0.7071067812 0.7071067812 2.6)
    arc 19 18 (-0.7071067812 0.7071067812 3.0)

    arc 13 12 (-0.7071067812 -0.7071067812 2.6)
    arc 18 17 (-0.7071067812 -0.7071067812 3.0)

    arc 12 11 (0.7071067812 -0.7071067812 2.6)
    arc 17 16 (0.7071067812 -0.7071067812 3.0)
);

boundary
(
    bottomWall
    {
        type wall;
        faces
        (
            (0 4 1 0)
            (0 3 4 0)
            (0 2 3 0)
            (0 1 2 0)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (1 6 7 2)
            (2 7 8 3)
            (9 4 3 8)
            (6 1 4 9)
        );
    }

    sideWalls
    {
        type wall;
        faces
        (
            (11 12 7 6)
            (12 13 8 7)
            (14 9 8 13)
            (11 6 9 14)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (16 17 12 11)
            (17 18 13 12)
            (16 11 14 19)
            (19 14 13 18)
        );
    }

    topWall
    {
        type wall;
        faces
        (
            (15 17 16 15)
            (15 16 19 15)
            (15 19 18 15)
            (15 18 17 15)
        );
    }


);

mergePatchPairs
(
);

// ************************************************************************* //
